tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "stripe/stripe-cli"
brew "age"
brew "pycparser", link: false
brew "cffi", link: false
brew "python-cryptography"
brew "python@3.11"
brew "ansible", link: false
brew "delve"
brew "fzf"
brew "git"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "go"
brew "goreleaser"
brew "helm"
brew "hugo"
brew "iperf3"
brew "istioctl"
brew "k3d"
brew "kubernetes-cli"
brew "python@3.9"
brew "libssh"
brew "lua"
brew "minikube"
brew "neovim"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "parallel"
brew "python@3.10"
brew "qemu"
brew "ripgrep"
brew "rustup-init"
brew "sdl2"
brew "sops"
brew "stow"
brew "terraform"
brew "tmux"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "stripe/stripe-cli/stripe"
cask "anaconda"
cask "arduino-ide"
cask "drawio"
cask "font-hack-nerd-font"
cask "gimp"
cask "monodraw"
cask "openemu"
cask "qmk-toolbox"
cask "rectangle"
vscode "eamodio.gitlens"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nickgo.cuelang"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
